app/views/links/index.html.erb

          <td><%= link_to "#{request.base_url}/#{link.shortened_url}", link.shortened_url, target: '_blank' %></td>
          <td><%= link.clicks.map(&:count).inject(:+)%></td>
---
SELECT  "clicks".* FROM "clicks" WHERE "clicks"."link_id" = $1 ORDER BY "clicks"."count" DESC LIMIT $2  [["link_id", 1], ["LIMIT", 1]]
SELECT Max(count) as max_count FROM "clicks" WHERE "clicks"."link_id" = $1  [["link_id", 1]]