app/controllers/links_controller.rb

  def index
    @links = Link.includes(:clicks)
---
SELECT  "clicks".* FROM "clicks" WHERE "clicks"."link_id" = $1 ORDER BY value DESC LIMIT $2  [["link_id", 1], ["LIMIT", 1]]
SELECT  "links".* FROM "links" ORDER BY "links"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT Max(count) as max_count FROM "clicks" WHERE "clicks"."link_id" = $1  [["link_id", 1]]

  def go
    link = Link.find_by(shortened_url: params["short_url"])
    click = Click.where(link: link.id).last
    if link.created_at < link.created_at + 30.days
      if click && click.user_id == current_user.id
        click.count += 1
        click.save
      elsif click && click.user_id != current_user.id
        click.count = 0
        Click.create(link_id: link.id, user_id: current_user.id, count: "#{click.count += 1}", ip_address: ip_address, country: country)
      end
      redirect_to link.given_url
    else
      link.destroy
---
SELECT  "links".* FROM "links" WHERE "links"."shortened_url" = $1 LIMIT 1  [["shortened_url", "hbhNWB"]]
SELECT  "clicks".* FROM "clicks" WHERE "clicks"."link_id" = 3 ORDER BY "clicks"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "clicks" ("user_id", "link_id", "count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["link_id", 29], ["count", 1], ["created_at", "2020-03-26 12:16:44.748182"], ["updated_at", "2020-03-26 12:16:44.748182"]]
SELECT COUNT(*) FROM "clicks" WHERE "clicks"."link_id" = 5 AND "clicks"."user_id" = $1  [["user_id", 1]]
UPDATE "clicks" SET "updated_at" = $1, "count" = $2 WHERE "clicks"."id" = $3  [["updated_at", "2020-03-26 12:11:55.648655"], ["count", 2], ["id", 29]]
UPDATE "links" SET "shortened_url" = $1, "updated_at" = $2 WHERE "links"."id" = $3  [["shortened_url", nil], ["updated_at", "2020-03-26 12:19:42.363939"], ["id", 29]]
DELETE FROM "links" WHERE "links"."id" = $1  [["id", 30]]

  def create
    @link = Link.new(link_params)
    unless link_params["given_url"].empty?
      url = @link.shorten(link_params["given_url"])
      @link.given_url = link_params["given_url"]
      @link.shortened_url = url
    end
    respond_to do |format|
      if @link.save
        Click.create(link_id: @link.id, user_id: current_user.id, count: 0, ip_address: ip_address, country: country)
---
INSERT INTO "links" ("given_url", "shortened_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["given_url", "https://dashboard.heroku.com/apps/stg-new-picnic/activity"], ["shortened_url", "eiuZ8r"], ["created_at", "2017-04-06 05:42:56.975268"], ["updated_at", "2017-04-06 05:42:56.975268"]]
INSERT INTO "clicks" ("user_id", "link_id", "created_at", "updated_at", "ip_address") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["link_id", 4], ["created_at", "2020-03-27 05:38:07.639079"], ["updated_at", "2020-03-27 05:38:07.639079"], ["ip_address", "172.20.10.4"]]